export default{
    INPUT_VALIDATA_TYPES:{
        //自然数，包含0和正整数
        "natureNum":/^[\+]?(([1-9]\d*)|\d)$/,
        // 数字 ---- 正负 小数整数都可以
        "decimals":/^[+-]?(?!\.)(\d*)(\.)*(\d+)$/,
        // 数字  ---- 正负 整数
        "number":/^[+-]?[0-9]*$/,
        // 正整数 
        "positive":/^[+]?[0-9]*[1-9][0-9]*$/,
        //正小数
        "positiveDecimals":/^[+]?(?!\.)(\d*)(\.)+(\d+)$/,
        // 正数
        "positiveNumber":/^[+]?(?!\.)(\d*)(\.)*(\d+)$/,
        //负数
        "negativeNumber":/^[-]+(?!\.)(\d+)(\.)*(\d+)$/,
        //负小数
        "negativeDecimals":/^[-]+(?!\.)(\d+)(\.)+(\d+)$/,
        //负整数
        "negative":/^[-]?[0-9]*[1-9][0-9]*$/,
        //汉字
       //  "characters":'/\p{Unified_Ideograph}/u',
        //emai
        "email":/^([a-zA-Z0-9]+[_|\_|\.]?)*[a-zA-Z0-9]+@([a-zA-Z0-9]+[_|\_|\.]?)*[a-zA-Z0-9]+\.[a-zA-Z]{2,3}$/,
        //url
        "url":/^((https|http)?:\/\/)([0-9a-z.]+)(:[0-9]+)?([/0-9a-z.]+)?(\?[0-9a-z&=]+)?(#[0-9-a-z]+)?/i,
        "https":/^((https)?:\/\/)([0-9a-z.]+)(:[0-9]+)?([/0-9a-z.]+)?(\?[0-9a-z&=]+)?(#[0-9-a-z]+)?/i,
        "http":/^((http)?:\/\/)([0-9a-z.]+)(:[0-9]+)?([/0-9a-z.]+)?(\?[0-9a-z&=]+)?(#[0-9-a-z]+)?/i,
        //身份证
        "id":/[1-9]\d{13,16}[a-zA-Z0-9]{1}/,
        //手机号 不包含固话
        "phone":/^((13[0-9])|(15[^4])|(18[0-9])|(17[0-9])|(147))\d{8}$/,
        //密码, 字母开头 长度6-18，只能包含字符 数字 和 下划线
        // "password":/^[a-zA-Z]\w{5,17}$/,
        "password":"",
        //电话号 包含固话 手机
        "tel":/^(^[1][\d]{10}$)|^([0\+]\d{2,3}-?)?(\d{7,8})(-?(\d{1,6}))?$/
    }
} 